{
  "backend/main.mo": "Implements cart and order management with Map storage and supports AliExpress product HTML fetching via HTTP outcalls.",
  "feature_evidence.json": "Lists feature evidence entries linking features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and recent updates of various frontend files.",
  "frontend/EMBEDDING_SHOPIFY.md": "Documentation explaining how to embed the storefront inside Shopify using an iframe.",
  "frontend/index.css": "Defines global Tailwind-based theme variables and styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, theming, query client, and cart context for the main React application.",
  "frontend/src/cart/cartStorage.ts": "Handles loading, saving, and clearing versioned cart data in localStorage.",
  "frontend/src/cart/cartTypes.ts": "Defines TypeScript interfaces for cart items and overall cart state.",
  "frontend/src/cart/useCart.tsx": "Provides React context and hooks for cart operations including add, remove, update, clear, and subtotal calculations.",
  "frontend/src/checkout/validation.ts": "Contains form validation logic for checkout fields with simple error messages.",
  "frontend/src/components/product/ImageGallery.tsx": "Displays product images with a main viewer, navigation controls, and selectable thumbnails.",
  "frontend/src/components/product/ProductDescription.tsx": "Shows product description and specifications inside an accordion-based card.",
  "frontend/src/components/product/ProductDetailSection.tsx": "Fetches and displays detailed product info including images, pricing, quantity selection, and add‑to‑cart logic.",
  "frontend/src/components/product/ReviewsSection.tsx": "Renders product review summary with star ratings and review count.",
  "frontend/src/components/product/ShippingReturns.tsx": "Shows shipping details and return policy in a styled card if available.",
  "frontend/src/components/StorefrontLayout.tsx": "Provides main storefront layout with separate embedded and full modes, rendering header, navigation, cart badge, and page content.",
  "frontend/src/config/storefrontProducts.ts": "Defines configuration for curated storefront products with optional display names and price overrides.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useEmbedMode.ts": "Determines whether the app is running in embed mode based on URL parameters.",
  "frontend/src/hooks/useEmbedNavigation.ts": "Provides navigation that preserves embed mode by appending the embed parameter to routes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, identity loading, login, logout, and related context exposure.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks to fetch normalized AliExpress product data and place orders via the actor API.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes with utility tweaks.",
  "frontend/src/lib/aliExpress/normalizeProduct.ts": "Parses AliExpress HTML to extract product fields with fallback logic and helper extractors.",
  "frontend/src/lib/aliExpress/productIdentity.ts": "Generates stable product IDs from AliExpress URLs and provides URL normalization.",
  "frontend/src/lib/aliExpress/productSource.ts": "Defines default AliExpress product URL and fetches product HTML through the backend actor.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/models/product.ts": "TypeScript interfaces defining product, images, variants, reviews, shipping, and metadata models.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, totals, and navigation for empty or filled carts.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders checkout form, validates input, submits orders, and clears cart on success.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details and navigation after a successful purchase.",
  "frontend/src/pages/ProductPage.tsx": "Page that fetches a single AliExpress product, displays its details, and supports adding it to the cart with quantity controls and loading/error states.",
  "frontend/src/pages/StorefrontPage.tsx": "Renders a list of predefined products using ProductDetailSection components separated by dividers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for the project's design system.",
  "project_state.json": "Tracks project requirements, existing features, and architectural notes for a multi-product dropshipping storefront with shared cart and checkout."
}